app/Validations/UserRules.php

SELECT *
FROM `login`
WHERE `uname` = 'user7009766371'
---
    public function  validateUser(string $str,string $fields, array $data, ?string &$error = null): bool
    {

        $user = db_connect()->table('login')->where('uname',esc($data['username']))->get()->getRow();