app/Controllers/Home.php

    public function login()
    {
        if (!session()->get('isLoggedIn')) {
            $data = [
                'title' => 'Login'
            ];

            if ($this->request->getMethod() == 'post') {
                helper('form');
                $rules = [
                    'username' => [
                        'rules' => 'required|regex_match[/[A-Za-z0-9]/]',
                        'label' => 'Username',
                        'errors' => [
                            'regex_match' => 'Please enter a valid phone number'
                        ],
                    ],
                    'password' => [
                        'rules' => 'required|validateUser[email,password]',
                        'label' => 'Password'
                    ],
                ];

                if (!$this->validate($rules))
                {
                    $data['validation'] = $this->validator;
                }
                    else {
                    $user = db_connect()->table('login')->where('uname', $this->request->getVar('username'))->get()->getRow();
---
SELECT *
FROM `login`
WHERE `uname` = 'user7009766371'